# ToWorksets Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredWorksetCollector..::..ToWorksets Method
FilteredWorksetCollector Class See Also
---
Returns the complete set of worksets that pass the filter(s).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<Workset> ToWorksets()
```

Visual Basic
---
```text
Public Function ToWorksets As IList(Of Workset)
```

Visual C++
---
```text
public:
IList<Workset^>^ ToWorksets()
```

# ### Return Value
The complete array of worksets.
# Remarks
This will reset the collector to the beginning and extract all worksets that pass the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The collector does not have a filter applied. Extraction or iteration of worksets is not permitted without a filter. |

# See Also
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace